IDEA StatiCa Open Model
OpenModel.GetExistingObject Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Add new object into collections
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public OpenElementId GetExistingObject(
	OpenElementId obj
)
Public Function GetExistingObject (
	obj As OpenElementId
) As OpenElementId
public:
OpenElementId^ GetExistingObject(
	OpenElementId^ obj
)
Parameters
obj
Type: IdeaRS.OpenModel.OpenElementId
Added object
Return Value
Type: OpenElementId
Return value 0 - OK, -1 - duplicit Id, -10 - the type of object there is not in the data colections
Remarks
 If the obj.Id is set to zero or lesser, this method finds the first available free Id and sets it into the obj.Id.
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace